Revit 2024 API
SphericalLightDistribution Constructor
 Creates a spherical light distribution object.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public SphericalLightDistribution()
Visual Basic
Public Sub New
Visual C++
public:
SphericalLightDistribution()
See Also
SphericalLightDistribution Class
SphericalLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace